Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The "Atmosphere" is the term we use to describe the ecosystem around the [AT Protocol](#at-protocol).
ja: 「Atmosphere」は、[ATプロトコル](#at-protocol)のエコシステムを説明するために使用する用語です。

source: The "collection" is a bucket of JSON [records](#record) in a [data repository](#data-repo). They support ordered list operations. Every collection is identified by an [NSID](#nsid-namespaced-id) which is expected to map to a [Lexicon](#lexicon) schema.
ja: 「コレクション」は、[データ リポジトリ](#data-repo)内のJSON[レコード](#record)のバケツです。順序付きリスト操作をサポートします。すべてのコレクションは、[NSID](#nsid-namespace-id)によって識別され、[Lexicon](#lexicon)スキーマにマップされることが想定されています。

source: The "data repository" or "repo" is the public dataset which represents a user. It is comprised of [collections](#collection) of JSON [records](#record) and unstructured [blobs](#blob). Every repo is assigned a single permanent [DID](#did-decentralized-id) which identifies it. Repos may also have any number of [domain handles](#handle) which act as human-readable names.
ja: 「データリポジトリ」または「リポジトリ」は、ユーザーを表すパブリックデータセットです。これは、JSON[レコード](#record)と非構造化[blob](#blob)の[コレクション](#collection)で構成されています。すべてのリポジトリには、それを識別する1つの永続的な[DID](#did-decentralized-id)が割り当てられます。リポジトリには、人間が読める名前として機能する[ドメインハンドル](#handle)をいくつでも持つことができます。

source: The **Authenticated Transfer Protocol**, aka **Atproto**, is a decentralized protocol for large-scale social web applications. This document will introduce you to the ideas behind the AT Protocol.
ja: **Authenticated Transferプロトコル**（別名**atproto**）は、大規模な分散型ソーシャルアプリケーション用のフェデレーションプロトコルです。このドキュメントでは、ATプロトコルの背後にある考え方を紹介します。

source: The **Authenticated Transfer Protocol**, aka **atproto**, is a decentralized protocol for large-scale social web applications. This document will introduce you to the ideas behind the AT Protocol.
ja: **Authenticated Transferプロトコル**（別名 **atproto**）は、大規模な分散型ソーシャルアプリケーション用のフェデレーションプロトコルです。このドキュメントでは、ATプロトコルの背後にある考え方を紹介します。

source: The *Skyblur* Lexicon permissions are defined and summarized differently:
ja: *Skyblur*のLexicon権限は、異なる方法で定義・要約されています。

source: The *simplest* type of app is one where the OAuth session is established directly between the user's device and the PDS, as demonstrated in the [cookbook/vanillajs-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme) example. It's simple because it doesn't require a dedicated backend service, only hosting static resources.
ja: *最もシンプル*な種類のアプリケーションは、[cookbook/vanillajs-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme)の例に示されているように、ユーザーのデバイスとPDSの間でOAuthセッションが直接確立されるものです。専用のバックエンドサービスが不要で、静的リソースをホストするだけでよいため、シンプルです。

source: The *value* of a label will determine its behavior. Some example label values are `porn`, `gore`, and `spam`.
ja: ラベルの*値*はその動作を決定します。ラベル値の例としては、`porn`、`gore`、`spam`があります。

source: The <a href="https://www.microcosm.blue/" target="_blank">Microcosm</a> community project maintains tools for working with AT records at scale without local mirroring.
ja: <a href="https://www.microcosm.blue/" target="_blank">Microcosm</a>コミュニティプロジェクトは、ローカルミラーリングなしでレコードを大規模に操作するためのツールを保守しています。

source: The API will respond with the `at://` URI of the post and a content hash of the post as the `cid`:
ja: このAPIは応答に投稿の`at://` URIと`cid`形式のコンテンツハッシュを持ちます。

source: The AT Proto model is that *speech* and *reach* should be two separate layers, built to work with each other. The “speech” layer should remain permissive, distributing authority and designed to ensure everyone has a voice. The “reach” layer lives on top, built for flexibility and designed to scale. AT Proto moderation is implemented using [Labels](/guides/labels).
ja: ATプロトコルのモデルでは、*スピーチ*と*リーチ*は別個の層として設計され、相互に連携して動作します。スピーチ層は寛容で権限を分散し、誰もが発言できることを重視します。リーチ層はその上に位置し、柔軟性とスケーラビリティのために設計されています。ATプロトコルのモデレーションは[ラベル](/guides/labels)を用いて実装されています。

source: The AT Protocol (Authenticated Transfer Protocol) is a standard for public conversation and an open-source framework for building social apps.
ja: ATプロトコル（Authenticated Transferプロトコル）は公開会話の標準であり、ソーシャルアプリを構築するためのオープンソースフレームワークです。

source: The AT Protocol distributes user data across different nodes of your network, using the core building blocks of the web. The AT Protocol interconnects applications so that their backends share state, including user accounts and content, in individual data repositories. Many operations you'll perform when working with AT apps involve reading and writing these data repositories.
ja: ATプロトコルは、ウェブの基本的な構成要素を用いてネットワークの異なるノードにユーザーデータを分散します。ATプロトコルはアプリケーションを相互接続し、各バックエンドが個々のデータリポジトリに含まれるアカウントやコンテンツなどの状態を共有します。ATアプリで行う操作の多くは、これらのデータリポジトリの読み書きを伴います。

source: The AT Protocol distributes user data across different nodes of your network, using the core building blocks of the web. The AT Protocol interconnects applications so that their backends share state, including user accounts and content, in individual data repositories. Many operations you'll perform when working with Atproto apps involve reading and writing these data repositories.
ja: ATプロトコルは、ウェブの基本的な構成要素を用いてネットワークの異なるノードにユーザーデータを分散します。ATプロトコルはアプリケーションを相互接続し、各バックエンドが個々のデータリポジトリに含まれるアカウントやコンテンツなどの状態を共有します。atprotoアプリで行う操作の多くは、これらのデータリポジトリの読み書きを伴います。

source: The AT Protocol has a federated network architecture, meaning that account data is stored on host servers, as opposed to a peer-to-peer model between end devices. Federation was chosen to ensure the network is convenient to use and reliably available. Repository data is synchronized between servers over standard web technologies ([HTTP](/specs/xrpc) and [WebSockets](/specs/event-stream)).
ja: ATプロトコルにはフェデレーションネットワークアーキテクチャがあり、エンドデバイス間のピアツーピアモデルではなく、アカウントデータがホストサーバーに保存されます。フェデレーションは、ネットワークが使いやすく、確実に利用できるようにするために選択されました。リポジトリデータは、標準ウェブテクノロジー（[HTTP](/specs/xrpc)および[WebSocket](/specs/event-stream)）を介してサーバー間で同期されます。

source: The AT Protocol is an open, decentralized network for building social applications. {{ className: 'lead' }}
ja: ATプロトコルは、ソーシャルアプリケーションを構築するためのオープンな分散型ネットワークです。{{ className: 'lead' }}

source: The AT Protocol is architected in a “big world with small world fallbacks” way, modeled after the open web itself. With the web, individual computers upload content to the network, and then all of that content is then broadcasted back to other computers. Similarly, with the AT Protocol, we're sending messages to a much smaller number of big aggregators, which then broadcast that data to personal data servers across the network.
ja: ATプロトコルは、オープンウェブそのものをモデルにした「小さな世界へのフォールバックを伴う大きな世界」という設計です。ウェブでは、個々のコンピューターがコンテンツをネットワークにアップロードし、そのすべてのコンテンツが他のコンピューターへブロードキャストされます。同様に、ATプロトコルでは、少数の大規模アグリゲーターにメッセージを送り、ネットワーク全体のパーソナルデータサーバーへデータをブロードキャストします。

source: The AT Protocol merges p2p tech with high-scale systems practices. Our founding engineers were core [IPFS](https://en.wikipedia.org/wiki/InterPlanetary_File_System) and [Dat](https://en.wikipedia.org/wiki/Dat_(software)) engineers, and Martin Kleppmann &mdash; the author of [Data Intensive Applications](https://www.oreilly.com/library/view/designing-data-intensive-applications/9781491903063/) &mdash; is an active technical advisor.
ja: ATプロトコルは、P2Pテクノロジーと大規模システムの実践を融合します。当社の創設エンジニアは、[IPFS](https://en.wikipedia.org/wiki/InterPlanetary_File_System)および[Dat](https://en.wikipedia.org/wiki/Dat_(software))のコアエンジニアであり、[Data Intensive Applications](https://www.oreilly.com/library/view/designing-data-intensive-applications/9781491903063/)の著者であるMartin Kleppmannは、アクティブな技術アドバイザーです。

source: The AT Protocol stands for "Authenticated Transfer Protocol," and is frequently shortened to "atproto." The name is in reference to the fact that all user-data is signed by the authoring users, which makes it possible to broadcast the data through many services and prove it's real without having to speak directly to the originating server.
ja: ATプロトコルは、「Authenticated Transfer Protocol」の略です。この名前は、すべてのユーザーデータが作成ユーザーによって署名されているという事実に由来しています。これにより、多くのサービスを通じてデータをブロードキャストし、発信元サーバーと直接通信しなくても、データが本物であることを証明できます。

source: The AT Protocol uses a lot of terms that may not be immediately familiar. This page gives a quick reference to these terms and includes some links to more information. {{className: 'lead'}}
ja: ATプロトコルでは、すぐには馴染みのない用語が多数使用されています。このページでは、これらの用語を簡単に参照でき、追加情報へのリンクも含まれています。 {{className: 'lead'}}

source: The App View communicates the current state of its indices by setting the `Atproto-Repo-Rev` response header. This is set by the `rev` of the most recent commit that's been indexed from the requesting user's repository. If the PDS sees this header on a response, it will search for all records that it has locally that are more recent than the provided rev and determine if they affect the App View's response.
ja: AppViewは`Atproto-Repo-Rev`応答ヘッダーを設定することで、現在のインデックス状況を伝えます。これは、要求元のユーザーのリポジトリからインデックスされた最新のコミットの`rev`に設定されます。PDSは応答でこのヘッダーを検出すると、提示されたリビジョンよりも新しいローカルに存在するすべてのレコードを検索し、それらがAppViewの応答に影響を与えるかどうかを判断します。

source: The AppView hydrates the feed (user info, post contents, aggregates, etc.)
ja: AppViewがフィードをハイドレート（ユーザー情報、投稿内容、集計値などの注入）します

source: The AppView resolves the at-uri and finds the DID doc of the Feed Generator
ja: AppViewがat-uriを解決し、フィードジェネレーターのDIDドキュメントを見つけます

source: The AppView returns the hydrated feed to the user
ja: AppViewがハイドレートされたフィードをユーザーに返します

source: The AppView sends a getFeedSkeleton request to the service endpoint declared in the Feed Generator's DID doc
ja: AppViewがフィードジェネレーターのDIDドキュメントで宣言されたサービスエンドポイントにgetFeedSkeletonリクエストを送信します

source: The Atmosphere is built to be distributed, which means anyone can and should feel free to host their own AT Protocol infrastructure. If you are self-hosting at scale, i.e. offering a service for many thousands of users, you will likely need to perform some additional "hardening" of your hosted service, and make more complication decisions about provisioning your infrastructure.
ja: Atmosphereは分散型として構築されているため、誰もが自分のATプロトコルのインフラをホストできるようになっています。大規模な自己ホスト、つまり数千人のユーザーにサービスを提供する場合、ホストされたサービスの追加の「強化」が必要になる可能性があり、インフラの用意について更に複雑な判断が求められます。

source: The Atmosphere is built to be distributed, which means anyone can and should feel free to host their own AT Protocol infrastructure. If you are self-hosting at scale, i.e. offering a service for many thousands of users, you will likely need to perform some additional “hardening” of your hosted service, and make more complication decisions about provisioning your infrastructure.
ja: Atmosphereは分散型として構築されているため、誰もが自分のATプロトコルのインフラをホストできるようになっています。大規模な自己ホスト、つまり数千人のユーザーにサービスを提供する場合、ホストされたサービスの追加の「強化」が必要になる可能性があり、インフラの用意について更に複雑な判断が求められます。

source: The Atmosphere works the same way, except we're going to check `at://` instead of `https://`. Each user has a data repo under an `at://` URL. We'll crawl all the user data repos in the Atmosphere for all the "status.json" records and aggregate them into our SQLite database.
ja: Atmosphereも同様に動作しますが、`https://`ではなく`at://`をチェックします。各ユーザーには`at://` URLの下にデータリポジトリがあります。Atmosphere内のすべてのユーザーデータリポジトリをクロールして、すべての"status.json"レコードを取得し、それらをSQLiteデータベースに集約します。

source: The Atproto model is that *speech* and *reach* should be two separate layers, built to work with each other. The “speech” layer should remain permissive, distributing authority and designed to ensure everyone has a voice. The “reach” layer lives on top, built for flexibility and designed to scale. Atproto moderation is implemented using [Labels](/guides/labels).
ja: atprotoのモデルでは、*スピーチ*と*リーチ*は別個の層として設計され、相互に連携して動作します。スピーチ層は寛容で権限を分散し、誰もが発言できることを重視します。リーチ層はその上に位置し、柔軟性とスケーラビリティのために設計されています。atprotoのモデレーションは[ラベル](/guides/labels)を用いて実装されています。

source: The Bluesky web application
ja: Blueskyウェブアプリ

source: The Community Guidelines have been moved to <0/>
ja: コミュニティガイドラインは<0/>に移動しました

source: The Copyright Policy has been moved to <0/>
ja: 著作権ポリシーは<0/>に移動しました

source: The DNS handle is a user-facing identifier — it should be displayed in user interfaces and promoted as a way to find users. Applications resolve handles to DIDs and then use the DID as the canonical identifier for accounts. Any DID can be rapidly resolved to a DID document which includes public keys and user services.
ja: DNSハンドルはユーザー向けの識別子です。UIに表示され、ユーザーを見つける方法として宣伝される必要があります。アプリケーションはハンドルをDIDに解決し、DIDを安定した正規の識別子として使用します。その後、DIDは公開鍵とユーザーサービスを含むDIDドキュメントに安全に解決できます。

source: The Discover feed
ja: Discoverフィード

source: The Discover feed now knows what you like
ja: Discoverフィードはあなたの好みを学習しました

source: The Feed Generator returns a skeleton of the feed to the AppView
ja: フィードジェネレーターがフィードのスケルトンをAppViewに返します

source: The OAuth flow requires permission "scopes" which describe the level of access granted with the session. For now, granular permissions have been implemented on the `bsky.social` hosting service, and the [self-hosted PDS distribution](/guides/self-hosting). Work on permission sets (including lexicon resolution) is in progress. Developers may start to implement more granular permissions -- for example, apps only asking for permissions to specific record types or API endpoints. We expect most apps to use the higher-level "permission sets" when they become available, which will provide more accessible language about the permissions being granted.
ja: OAuthフローはセッションで付与されるアクセスのレベルを表す「スコープ」を必要とします。現時点では、権限の粒度は`bsky.social`ホスティングサービスや[セルフホスト型PDSディストリビューション](/guides/self-hosting)上に実装されています。権限セットに関する作業（レキシコン解決を含む）は進行中です。開発者はより細かい権限（例えば特定のレコード種別やAPIエンドポイントの権限のみを要求するアプリ）を実装できるようになるでしょう。多くのアプリは、利用できるようになったら、より分かりやすい言語で権限を示す高レベルの「権限セット」を使用すると予想されます。

source: The PDS Docker image includes [goat](https://github.com/bluesky-social/goat), our command line tool for performing admin functions.
ja: PDSのDockerイメージには、管理機能を実行するためのコマンドラインツール[goat](https://github.com/bluesky-social/goat)が含まれています。

source: The PDS handles:
ja: PDSは以下を担います。

source: The PDS has restrictive CORS headers by default.
ja: PDSはデフォルトで制限的なCORSヘッダーを持っています。

source: The PDS implementation includes [repo operation limits](https://docs.bsky.app/docs/advanced-guides/rate-limits) by default.
ja: PDS実装にはデフォルトで[リポジトリ操作制限](https://docs.bsky.app/docs/advanced-guides/rate-limits)が含まれています。

source: The Privacy Policy has been moved to <0/>
ja: プライバシーポリシーは<0/>に移動しました

source: The SDK stores this session information for you, and will include it in the headers of its requests.
ja: SDKはこのセッション情報を保存し、リクエストのヘッダに含めます。

source: The Terms of Service have been moved to
ja: サービス規約は移動しました

source: The Typescript SDK also provides the DID of the currently-authenticated as `client.did`:
ja: Typescript SDKは、現在認証されているユーザーのDIDを`client.did`として提供します。

source: The [DID standard](https://www.w3.org/TR/did-core/) describes a framework for different "methods" of publishing and resolving DIDs to the [DID Document](https://www.w3.org/TR/did-core/#core-properties), instead of specifying a single mechanism. A variety of existing methods [have been registered](https://w3c.github.io/did-spec-registries/#did-methods), with different features and properties. We established the following criteria for use with atproto:
ja: [DID標準](https://www.w3.org/TR/did-core/)は、DIDを公開し、[DIDドキュメント](https://www.w3.org/TR/did-core/#core-properties)に解決する「メソッド」を、ただ一つに定めず多様に定義できるフレームワークを設けています。さまざまな既存のメソッドが[公開](https://w3c.github.io/did-spec-registries/#did-methods)されおり、それぞれ異なる機能や特徴を持ちます。atprotoでの使用に際して、以下の基準を設定しました。

source: The [Lexicons](/guides/lexicon) help identify the data being published on the network. You use them to validate data as you read it, just like you validate incoming HTTP requests.
ja: [Lexicon](/guides/lexicon)は、ネットワーク上で公開されるデータの識別に役立ちます。受け取ったHTTPリクエストを検証するように、読み取り時のデータ検証に使います。

source: The [atproto Lexicon system](https://atproto.com/specs/lexicon) describes a data model and schema language for validating data against a known schema. But what if you are processing data where the schema isn't known or present?
ja: [atprotoのLexiconシステム](https://atproto.com/specs/lexicon)は、既知のスキーマに対してデータを検証するためのデータモデルとスキーマ言語について説明しています。しかし、スキーマが不明または存在しないデータを処理している場合はどうでしょうか？

source: The [code](https://github.com/bluesky-social/atproto) to power a fully distributed Atmosphere is constantly improving. Here's a guide with some lessons and best practices for managing your own services.
ja: 完全に分散されたAtmosphereを動かすための[コード](https://github.com/bluesky-social/atproto)は常に改善され続けています。ここでは、自分のサービスを管理するための教訓と最適なプラクティスに関するガイドを提供します。

source: The `adultOnly` establishes whether the label should be configurable if adult content is disabled.
ja: `adultOnly`は、アダルトコンテンツが無効の場合、ラベルを設定可能にするべきかを規定します。

source: The `blob:*/*` permission for image/video handling cannot be included in permission sets and must always be requested separately.
ja: 画像/動画の取り扱い用の`blob:*/*`権限は権限セットに含めることができず、常に個別に要求する必要があります。

source: The `com.atproto.server.createSession` API endpoint called by `agent.login()` returns a session object containing two API tokens: * `accessJwt`: an access token which is used to authenticate requests but expires after a few minutes * `refreshJwt`: a refresh token which lasts longer and is used only to update the session with a new access token
ja: `agent.login()`が呼ぶ`com.atproto.server.createSession` APIエンドポイントは、2つのAPIトークンを含むセッションオブジェクトを返します。 * `accessJwt`：数分で期限が切れる、リクエストを認証するために使用されるアクセストークン * `refreshJwt`：期限が長く、アクセストークンを更新するためだけに使用されるリフレッシュトークン

source: The `com.atproto.server.createSession` API endpoint called by login methods returns a session object containing two API tokens: * `accessJwt`: an access token which is used to authenticate requests but expires after a few minutes * `refreshJwt`: a refresh token which lasts longer and is used only to update the session with a new access token
ja: ログインメソッドが呼ぶ`com.atproto.server.createSession` APIエンドポイントは、2つのAPIトークンを含むセッションオブジェクトを返します。 * `accessJwt`：数分で期限が切れる、リクエストを認証するために使用されるアクセストークン * `refreshJwt`：期限が長く、アクセストークンを更新するためだけに使用されるリフレッシュトークン

source: The `defaultSetting` establishes how the label will be configured when the user first subscribes to the labeler.
ja: `defaultSetting`は、ユーザーが最初にラベラーを登録するときにラベルがどのように設定されるかを規定します。

source: The `labelValueDefinitions` defines the custom labels. It includes the `locales` field for specifying human-readable copy in various languages. If the user's language is not found, it will use the first set of strings in the array.
ja: `labelValueDefinitions`はカスタムラベルを定義します。様々な言語で人間可読なコピーを指定するための`locales`フィールドが含まれます。ユーザーの言語が見つからない場合は、配列の先頭の文字列セットを使用します。

source: The `labelValues` declares what to expect from the Labeler. It may include global and custom label values.
ja: `labelValues`はラベラーから何が期待できるかを宣言します。グローバルまたはカスタムラベル値が含まれます。

source: The `setCurrStatus` helper ensures only the most recent status per user has `current = 1`. This will be used later on.
ja: `setCurrStatus`ヘルパーは、各ユーザーで最新ステータスだけが`current = 1`になるよう保証します。この後の処理で利用します。

source: The `title` and `details` fields are descriptive, and will be displayed as part of the OAuth flow; see the [for users](#for-users) section for an example. Internationalization of these descriptive fields is supported — refer to [the permission sets spec](/specs/permission#permission-sets).
ja: `title`と`details`フィールドは説明用で、OAuthフローの一部として表示されます。例は[利用者向け](#for-users)セクションを参照してください。これらの説明フィールドは国際化にも対応しています。詳細は[権限セット仕様](/specs/permission#permission-sets)を参照してください。

source: The account will be able to interact with you after unblocking.
ja: このアカウントは、ブロック解除後にあなたとやり取りすることができます。

source: The app will be restarted
ja: アプリを再起動します

source: The atproto identity system has a number of requirements:
ja: atprotoのIDシステムには、いくつかの要件があります。

source: The auth flow page will display all the relevent permissions being granted. This is true both for apps using [granular permissions](/specs/permission), and for those using the [transitional](/specs/oauth#authorization-scopes) OAuth scopes.
ja: 認可フローのページは付与される関連権限をすべて表示します。これは[細分化されたスコープ](/specs/permission)を使うアプリでも、[移行スコープ](/specs/oauth#authorization-scopes)を使うものでも同様です。

source: The author of this thread has hidden this reply.
ja: このスレッドの投稿者がこの返信を非表示にしました

source: The base layer of atproto (personal data repositories and federated networking) creates a common space for speech where everyone is free to participate, analogous to the Web where anyone can put up a website. The indexing services then enable reach by aggregating content from the network, analogous to a search engine.
ja: atprotoの基本レイヤー（パーソナルデータリポジトリとフェデレーションネットワーク）は、誰もが自由に参加できるスピーチのための共通スペースを作成します。これは、誰でもサイトを作成できるウェブに似ています。次に、インデックスサービスがネットワークからコンテンツを集約してリーチを有効にします。これは、検索エンジンに似ています。

source: The birthdate you've entered means you are under 18 years old. Certain content and features may be unavailable to you.
ja: 入力した生年月日は、あなたが18歳未満であることを意味します。特定のコンテンツや機能が利用できない場合があります。

source: The checkpoint will contain a rev value that you can use to skip any buffered events that have already been included in said checkpoint.
ja: チェックポイントにはrevが含まれており、そのチェックポイントに既にあるイベントをバッファからスキップするのに使用できます。

source: The classic, happy Web architecture is the “one big SQL database” behind our app server. The app talks to the database and handles requests from the frontend.
ja: 従来の、使いやすいウェブアーキテクチャは、アプリサーバーの背後にある「1つの大きなSQLデータベース」です。アプリはデータベースと通信し、フロントエンドからのリクエストを処理します。

source: The content of a repository is laid out in a [Merkle Search Tree (MST)](https://hal.inria.fr/hal-02303490/document) which reduces the state to a single root hash. It can be visualized as the following layout:
ja: リポジトリの内容は[Merkle探索木（MST）](https://hal.inria.fr/hal-02303490/document)にレイアウトされ、状態が単一のルートハッシュに縮小されます。これは次のレイアウトとして視覚化できます。

source: The content on these platforms isn't just documents that can be served statically. Rather these platforms process billions of interactions every day. These interactions in turn are composed into rich and dynamic views to serve to users: profile pages, news feeds, threads, like counts, and more.
ja: これらのプラットフォーム上のコンテンツは、単に静的に提供される文書ではありません。これらのプラットフォームは毎日何十億ものインタラクションを処理します。それらのインタラクションは、プロフィールページ、ニュースフィード、スレッド、いいね数など、リッチで動的なビューとしてユーザーに提供されます。

source: The data model (the repository) that PDSs adhere to is generic. The PDS as a whole actually has a very simple job: host the users data and manage their account/identity. This simplicity is intentional and important to keeping the data layer resilient and locked open. If a PDS becomes overloaded with application-specific logic or expensive indexing behavior, it runs the risk of warping incentives towards vendor lock-in and centralization.
ja: PDSのデータモデル（リポジトリ）は汎用的なものです。PDSの役割はとてもシンプルで、ユーザーデータのホスティングとアカウント/ID管理だけです。この単純さは意図的であり、データ層を強靭でロックインされない状態に保つために重要です。PDSがアプリケーション固有のロジックや高価なインデックス処理で過積載になると、ベンダーロックインや中央集権化へインセンティブが歪むリスクがあります。

source: The data model of atproto is very similar to that of p2p networks. The major difference is that rather than being simply content-addressed, a layer of indirection is added to make the data identity-addressed. Therefore an at-uri looks like `at://username/record-type/record-key`.
ja: atprotoのデータモデルはP2Pネットワークのそれに非常に似ています。大きな違いは、単なるコンテンツアドレッシングではなく、間接層を追加してデータをIDアドレッシング化している点です。したがって、at-uriは`at://username/record-type/record-key`のようになります。

source: The data that an identity outputs takes the form of a repository of “records”. Each record is a piece of structured data - a post, a like, a follow, a profile, etc. In the web, the primary object is the document and documents are linked together through hyperlinks. In atproto, the primary object is the record, and records are linked together through at-uri references.
ja: IDが出力するデータは「レコード」のリポジトリという形を取ります。各レコードは構造化データの断片で、投稿、いいね、フォロー、プロフィールなどを表します。ウェブでは主対象は文書であり、文書はハイパーリンクで結び付けられます。atprotoでは主対象はレコードであり、レコードはat-uri参照によって結び付けられます。

source: The empty blob (zero bytes) is valid in general, though it may be disallowed by individual Lexicons/applications.
ja: 空のblob（ゼロバイト）は一般的に有効ですが、個別のLexiconやアプリケーションによっては禁止される場合があります。
